package com.java;

        /*Написать свой класс MyQueue как аналог классу Queue, который будет работать
        по принципу FIFO (first-in-first-out).
        Можно делать либо с помощью Node либо с помощью массива.

        Методы
        add(Object value) добавляет элемент в конец
        remove(int index) удаляет элемент под индексом
        clear() очищает коллекцию
        size() возвращает размер коллекции
        peek() возвращает первый элемент в очереди (FIFO)
        poll() возвращает первый элемент в очереди и удаляет его из коллекции*/

public class MyQueue {

}
